# Операторы сравнения
## Основные операторы сравнения
## Сравнение строк
## Сравнение данных двух разных типов
## Цепочки сравнений
## Практические задания


# Условный оператор
## Синтаксис
## Отступы в python
## else
## Практические задания


# Операторы сравнения
## Основные операторы сравнения
# == != > >= < <= # bool (True/False)

print("Основные операторы сравнения")
print(1 > 2)
print(10 > 0)
print(1 == 2) # Равен ли один двум?
print(2 == 2)
print(1 != 3) # Не равно
print(3.14 > 2.71)

## Сравнение строк
print("Сравнение строк")
print('a' > 'b')
print('hello' > 'no')
print('hello' > 'heaa')
print('text' == 'text')

## Сравнение данных двух разных типов
print("Сравнение данных двух разных типов")
print(1 > 1.2)
# print(1 > 'hello') # TypeError: '>' not supported between instances of 'int' and 'str'

## Цепочки сравнений
print("Сравнение данных двух разных типов")
print(1 < 200 < 100)
print(1 < 200 and 200 < 100)

## Практические задания