### Задание 1: Приветствие
"""
Напишите программу, которая запрашивает у пользователя его имя и затем выводит приветствие с использованием функции `print()`. 

Пример:
Ваше имя: Анна
Привет, Анна!
"""


### Задание 2: Сложение двух чисел
"""
Создайте программу, которая запрашивает у пользователя два числа (целых) и выводит их сумму. Используйте функции `input()`, `int()` и `print()`.

Пример:
Первое число: 5
Второе число: 10
Сумма: 15
"""


### Задание 3: Обратная строка
"""
Создайте программу, которая запрашивает у пользователя строку и выводит первую и последнюю букву из этой строки. Используйте функции `input()` и `print()`.

Пример:
Ваша строка: Привет
Первая и последняя буква: Пт
"""

### Задание 4: Среднее арифметическое
"""
Напишите программу, которая запрашивает у пользователя три дробных числа, вычисляет их среднее арифметическое и выводит результат. Используйте функции `input()`, `float()`, `print()`.

Пример:
Первое число: 4.5
Второе число: 3.0
Третье число: 5.5
Среднее арифметическое: 4.333333333333333
"""
