# 1. Тайный код доступа
"""
Пользователь вводит два значения: число и слово.

Чтобы открыть дверь, должно выполняться любое одно из условий:
    - число равно 42
    - слово совпадает с "аксолоотль"
    - число делится на 7 
    - длина слова больше 5 символов

Задача: Напишите программу, которая проверяет, открывается ли дверь
и выводит на экран "Доступ разрешен" в случает успеха. Иначе — не 
выводите ничего.
"""

# 2. Магический квадрат
"""
Пользователь вводит число. Проверьте:
    - если число четное, выведите: "Это магическое число!".
    - если больше 10, выведите: "Это магическое число!".
    - если число кратно 3, выведите: "Число обладает силой!".
    - если число кратно 5, выведите: "Число обладает силой!".
    - иначе — не выводите ничего.
"""

# 3. Шпионская миссия
"""
Агент получает доступ к секретной информации, если:
    - введенный код совпадает с "007",
    - или его ранг "Генерал" 
    - или стаж работы ≥ 50 лет.

Задача: Напишите программу с вводом кода, ранга и стажа, которая выводит 
"Доступ разрешен" в случае успеха. Иначе — не выводите ничего.
"""

# 4. возрастной ценз
"""
Напишите программу, которая спрашивает у пользователя его возраст.
Если возраст больше или равен 16, выведите:
    "Добро пожаловать на курсы вождения!"
Если возраст меньше 16 — ничего не выводите
"""

# 5. Секретное слово
"""
Пользователь вводит слово. Напишите программу, которая:
    - Проверяет, совпадает ли это слово с "Абракадабра".
    - Если да, выводит: "Доступ открыт!"
    - Если нет — не выводит ничего.
"""

# 6. Платформа для знакомств
"""
Напишите программу, которая проверяет, находится ли возраст партнёра 
в заданном диапазоне. Потзователь вводит три числа, где:
    - первое число — минимальный возраст,
    - второе число — максимальный возраст,
    - третье число — возраст партнёра.
Если условие выполняется, выведите: "Приемлемо 🙃"
"""

# 7. Умный дом
"""
Напишите программу, которая:
    - Спрашивает у пользователя текущую температуру в комнате.
    - Если температура выше 25 градусов, выводит: "Включите кондиционер!"
    - Если температура ниже 10 градусов, выводит: "Включите обогреватель!""
"""

# 8. Определение сложности пароля
"""
Пользователь вводит пароль. Напишите программу, которая:
    - Проверяет, что длина пароля больше 8 символов.
    - Если да, выводит: "Надежный пароль!""
"""