# Функция len()

# len()  # intother_list

# a = len('Hello !!!') + 10
# print(a)


# Списки
# medicine = ['Бинт', 'Жгут', 'Аспирин', 'Активированный уголь']  # list
# print(medicine)

# other_list = ['Бинт', 10, 3.14, True, None, [1, 2, 3]]
# print(other_list)

# Доступ к элементам списка
# print(other_list[2])
# print([-1])

# Срезы
# print(other_list[1:4:1]) # start:stop:step

# Самостоятельная работа
# 1. Создать список из 5 элементов
# 2. Вывести на экран 3-й элемент
# 3. Вывести на экран последний элемент
# 4. Вывести на экран все элементы списка

produkt = ['Яблоко', 'Апельсин', 'Лимон', 'Лук'] 
print(produkt)