# 1Напишите программу, которая считывает три числа и выводит их сумму. 
# Каждое число записано в отдельной строке.

# number1 = int(input("Введите первое число: "))
# number2 = int(input("Введите первое число: "))
# number3 = int(input("Введите первое число: "))
# print('Сумма чисел:',number1+number2+number3)

# 2Напишите программу, которая считывает длины двух катетов в прямоугольном 
# треугольнике и выводит его площадь. 
# Каждое число записано в отдельной строке.

# a = int(input("Длина одного катета прямоугольного треугольника:"))
# b = int(input("Длина второго катета прямоугольного треугольника:"))
# S = 1/2*a*b
# print('Площадь трегольника:',S)

# 3Условие
# n школьников делят k яблок поровну, неделящийся остаток остается в корзинке. 
# Сколько яблок достанется каждому школьнику? Сколько яблок останется в корзинке? 
# Программа получает на вход числа n и k 
# и должна вывести искомое количество яблок (два числа).

# n = int(input("Количество школьников:"))
# k = int(input("Количество яблок:"))
# z1 = k//n
# z2 = k%n
# print(f"Каждому школьнику достанется по {z1} яблок(-а)")
# print(f"В корзинке останется яблок: {z2}")

# 5Напишите программу, которая приветствует пользователя, выводя слово Hello, 
# введенное имя и знаки препинания по образцу:

# name = input("Введите Имя:")
# print('Hello,',name)

# 6Условие
# Напишите программу, которая считывает целое число и выводит текст, 
# аналогичный приведенному в примере (пробелы важны!).
                                    
# number = int(input("Введите число: "))
# number1 = (number+1)
# number2 = (number-1)
# print(f'The next number for the number {number} is {number1}.\nThe previous number for the number {number} is {number2}.')

